#+header: :engine postgres
#+begin_src sql
CREATE DATABASE hw;
#+end_src

#+RESULTS:
|---|

#+header: :engine postgres
#+header: :database hw
#+begin_src sql
DROP TABLE IF EXISTS Students CASCADE;
DROP TABLE IF EXISTS Groups CASCADE;
DROP TABLE IF EXISTS Courses CASCADE;
DROP TABLE IF EXISTS Lecturers CASCADE;
DROP TABLE IF EXISTS Plan CASCADE;
DROP TABLE IF EXISTS Marks CASCADE;

CREATE TABLE Students (
       StudentId int not null,
       StudentName varchar(50) not null,
       GroupId int not null,

       PRIMARY KEY (StudentId)
);

CREATE TABLE Groups (
       GroupId int not null,
       GroupName varchar(50) not null
);

CREATE TABLE Courses (
       CourseId int not null,
       CourseName varchar(50) not null
);

CREATE TABLE Lecturers (
       LecturerId int not null,
       LecturerName varchar(50) not null
);

CREATE TABLE Plan (
       GroupId int not null,
       CourseId int not null,
       LecturerId int not null
);

CREATE TABLE Marks (
       StudentId int not null,
       CourseId int not null,
       Mark int not null
);
#+end_src

#+RESULTS:
| DROP TABLE   |
|--------------|
| DROP TABLE   |
| DROP TABLE   |
| DROP TABLE   |
| DROP TABLE   |
| DROP TABLE   |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |

#+header: :engine postgres
#+header: :database hw
#+begin_src sql
INSERT INTO Students (StudentId, StudentName, GroupId) VALUES
       (1, 'Иванов И.И.', 1),
       (2, 'Петров П.П.', 1),
       (3, 'Петров П.П.', 2),
       (4, 'Сидров С.С.', 2),
       (5, 'Неизвестный Н.Н.', 3),
       (6, 'Безымянный Б.Б', 4),
       (10, 'AMOGUS', 4);

INSERT INTO Groups (GroupId, GroupName) VALUES
    (1, 'M3435'),
    (2, 'M3439'),
    (3, 'M3238'),
    (4, 'M3239');

INSERT INTO Courses (CourseId, CourseName) VALUES
    (1, 'Базы данных'),
    (2, 'Управление проектами'),
    (3, 'ППО'),
    (4, 'Теория информации'),
    (6, 'Математический анализ'),
    (7, 'Технологии Java');

INSERT INTO Lecturers (LecturerId, LecturerName) VALUES
    (1, 'Корнеев Г.А.')  ,
    (2, 'Будин Н.А.')   ,
    (3, 'Кузнецова Е.М.'),
    (4, 'Киракозов А.Х.'),
    (6, 'Трофимюк Г.А.') ,
    (7, 'Беляев Е.А.')  ,
    (8, 'Кохась К.П.')   ;

INSERT INTO Plan (GroupId, CourseId, LecturerId) VALUES
    (1, 1, 2),
    (2, 1, 1),
    (1, 2, 3),
    (1, 3, 4),
    (2, 3, 4),
    (2, 4, 6),
    (1, 4, 7),
    (2, 4, 7),
    (4, 6, 8),
    (1, 7, 1),
    (2, 7, 1),
    (3, 7, 1),
    (4, 7, 1);

INSERT INTO Marks (StudentId, CourseId, Mark) VALUES
    (1, 1, 5),
    (2, 1, 4),
    (3, 1, 3),
    (2, 2, 3),
    (3, 2, 4),
    (4, 2, 5),
    (7, 1, 5),
    (8, 1, 5),
    (7, 7, 5),
    (8, 7, 5),
    (5, 7, 5),
    (6, 7, 5),
    (3, 3, 3);
#+end_src

#+RESULTS:
| INSERT 0 7  |
|-------------|
| INSERT 0 4  |
| INSERT 0 6  |
| INSERT 0 7  |
| INSERT 0 13 |
| INSERT 0 13 |
